# Задача 30:  Заполните массив элементами арифметической прогрессии. Её первый элемент, разность и количество элементов нужно ввести с клавиатуры. 
# Формула для получения n-го члена прогрессии: an = a1 + (n-1) * d.
# Каждое число вводится с новой строки.

print("ввидите кол-во элементов массива:")
N = int(input())

print("Введите первое значение массива:")
a = int(input())

print("Введите разницу между элементами:")
n = int(input())

print("--------------")

for i in range(N-1):
    print("i=",i)
    print(a + i * n)